read_verilog -sv -DSYNTHESIS -DYOSYS_LITE /workspaces/The-Thiele-Machine/thielecpu/hardware/rtl/thiele_cpu_unified.v
prep -top thiele_cpu
techmap; opt -fast
clean -purge
stat
write_json /tmp/tmpl4fvvtd9/thiele_cpu.json
