read_verilog -sv -DSYNTHESIS /workspaces/The-Thiele-Machine/thielecpu/hardware/rtl/thiele_cpu_kami_synth.v
prep -top mkModule1_synth
techmap; opt -fast
clean -purge
stat
write_json /tmp/tmp4cnw_n3q/thiele_cpu.json
